resources/templates/ks_payment.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <KS_Tahsilat xmlns="https://turkpara.com.tr/">
            <G>
                <CLIENT_CODE></CLIENT_CODE>
                <CLIENT_USERNAME></CLIENT_USERNAME>
                <CLIENT_PASSWORD></CLIENT_PASSWORD>
            </G>
            <GUID></GUID>
            <KS_GUID></KS_GUID>
            <CVV></CVV>
            <KK_Sahibi_GSM></KK_Sahibi_GSM>
            <Hata_URL></Hata_URL>
            <Basarili_URL></Basarili_URL>
            <Siparis_ID></Siparis_ID>
            <Siparis_Aciklama></Siparis_Aciklama>
            <Taksit></Taksit>
            <Islem_Tutar></Islem_Tutar>
            <Toplam_Tutar></Toplam_Tutar>
            <Islem_Guvenlik_Tip></Islem_Guvenlik_Tip>
            <Islem_ID></Islem_ID>
            <IPAdr></IPAdr>
            <Ref_URL></Ref_URL>
            <Data1></Data1>
            <Data2></Data2>
            <Data3></Data3>
            <Data4></Data4>
            <KK_Islem_ID></KK_Islem_ID>
        </KS_Tahsilat>
    </soap:Body>
</soap:Envelope>
